{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"name": "lambda_4", "trainable": true, "batch_input_shape": [null, 66, 200, 3], "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000d\u0001\u001b\u0000d\u0002\u0018\u0000S\u0000)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-27-1e86824db90d>\u00da\b<lambda>5\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_16", "trainable": true, "nb_filter": 24, "nb_row": 5, "nb_col": 5, "init": "glorot_uniform", "activation": "elu", "border_mode": "valid", "subsample": [2, 2], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_17", "trainable": true, "nb_filter": 36, "nb_row": 5, "nb_col": 5, "init": "glorot_uniform", "activation": "elu", "border_mode": "valid", "subsample": [2, 2], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_18", "trainable": true, "nb_filter": 48, "nb_row": 5, "nb_col": 5, "init": "glorot_uniform", "activation": "elu", "border_mode": "valid", "subsample": [2, 2], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_19", "trainable": true, "nb_filter": 64, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "elu", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_20", "trainable": true, "nb_filter": 64, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "elu", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "p": 0.5}}, {"class_name": "Flatten", "config": {"name": "flatten_4", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_13", "trainable": true, "output_dim": 100, "init": "glorot_uniform", "activation": "elu", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 1152}}, {"class_name": "Dense", "config": {"name": "dense_14", "trainable": true, "output_dim": 50, "init": "glorot_uniform", "activation": "elu", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 100}}, {"class_name": "Dense", "config": {"name": "dense_15", "trainable": true, "output_dim": 10, "init": "glorot_uniform", "activation": "elu", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 50}}, {"class_name": "Dense", "config": {"name": "dense_16", "trainable": true, "output_dim": 1, "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 10}}], "keras_version": "1.2.2"}